-- MySQL dump 10.13  Distrib 8.0.45, for Linux (x86_64)
--
-- Host: localhost    Database: accounts_manager
-- ------------------------------------------------------
-- Server version	8.0.45-0ubuntu0.24.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `accounts`
--

DROP TABLE IF EXISTS `accounts`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `accounts` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `person_id` bigint unsigned NOT NULL,
  `currency_id` bigint unsigned NOT NULL,
  `balance` decimal(15,2) NOT NULL DEFAULT '0.00',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `accounts_person_id_currency_id_unique` (`person_id`,`currency_id`),
  KEY `accounts_currency_id_foreign` (`currency_id`),
  CONSTRAINT `accounts_currency_id_foreign` FOREIGN KEY (`currency_id`) REFERENCES `currencies` (`id`) ON DELETE CASCADE,
  CONSTRAINT `accounts_person_id_foreign` FOREIGN KEY (`person_id`) REFERENCES `people` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=58 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `accounts`
--

LOCK TABLES `accounts` WRITE;
/*!40000 ALTER TABLE `accounts` DISABLE KEYS */;
INSERT INTO `accounts` VALUES (1,1,1,5245.00,'2025-06-16 19:52:00','2026-07-06 13:14:23'),(2,2,1,-2055.00,'2025-06-16 19:52:40','2026-06-26 15:22:14'),(4,4,1,-630.00,'2025-06-16 19:53:47','2026-06-18 19:26:40'),(6,6,1,0.00,'2025-06-16 19:54:30','2026-01-08 06:50:32'),(8,8,1,10000.00,'2025-06-17 14:30:21','2025-11-24 19:55:43'),(15,14,1,1470.00,'2025-07-02 09:22:29','2026-07-16 15:03:40'),(26,6,2,0.00,'2025-08-18 11:09:32','2025-09-05 21:46:24'),(27,19,1,8795.00,'2025-09-12 15:42:17','2026-04-13 12:11:51'),(29,6,4,0.00,'2025-09-15 19:21:25','2025-09-15 19:28:04'),(34,23,1,-205.00,'2025-10-28 21:38:14','2026-07-06 13:14:58'),(36,6,5,0.00,'2025-11-19 13:50:14','2026-06-18 19:25:55'),(37,25,1,700.00,'2025-12-22 16:59:23','2026-05-15 21:45:51'),(43,29,1,9860.00,'2026-01-20 09:09:42','2026-03-06 13:45:31'),(44,14,5,243000.00,'2026-01-22 11:02:23','2026-07-10 11:10:03'),(46,32,1,-2900.00,'2026-03-14 21:14:43','2026-05-18 18:19:53'),(51,36,1,17800.00,'2026-04-30 08:59:13','2026-05-30 14:02:57'),(52,31,1,90.00,'2026-04-30 08:59:34','2026-06-15 15:33:18');
/*!40000 ALTER TABLE `accounts` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `cache`
--

DROP TABLE IF EXISTS `cache`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `cache` (
  `key` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `value` mediumtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `expiration` int NOT NULL,
  PRIMARY KEY (`key`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cache`
--

LOCK TABLES `cache` WRITE;
/*!40000 ALTER TABLE `cache` DISABLE KEYS */;
INSERT INTO `cache` VALUES ('account_manager_cache_admin|105.190.202.99','i:2;',1782151206),('account_manager_cache_admin|105.190.202.99:timer','i:1782151206;',1782151206);
/*!40000 ALTER TABLE `cache` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `cache_locks`
--

DROP TABLE IF EXISTS `cache_locks`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `cache_locks` (
  `key` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `owner` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `expiration` int NOT NULL,
  PRIMARY KEY (`key`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cache_locks`
--

LOCK TABLES `cache_locks` WRITE;
/*!40000 ALTER TABLE `cache_locks` DISABLE KEYS */;
/*!40000 ALTER TABLE `cache_locks` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `currencies`
--

DROP TABLE IF EXISTS `currencies`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `currencies` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `code` varchar(3) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `symbol` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `rate_to_usd` decimal(10,4) NOT NULL DEFAULT '1.0000',
  `is_base` tinyint(1) NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `currencies_code_unique` (`code`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `currencies`
--

LOCK TABLES `currencies` WRITE;
/*!40000 ALTER TABLE `currencies` DISABLE KEYS */;
INSERT INTO `currencies` VALUES (1,'USD','الدولار الأمريكي','$',1.0000,1,'2025-06-16 19:49:54','2025-06-16 19:49:54'),(2,'SAR','الريال السعودي','ر.س',3.7500,0,'2025-06-16 19:49:54','2025-06-16 19:49:54'),(3,'EUR','اليورو','€',0.8500,0,'2025-06-16 19:49:54','2025-06-16 19:49:54'),(4,'TRY','الليرة التركية','₺',39.0000,0,'2025-06-16 19:49:54','2025-06-20 09:09:58'),(5,'SYP','الليرة السورية','ل.س',9500.0000,0,'2025-06-16 19:49:54','2025-06-20 09:09:52');
/*!40000 ALTER TABLE `currencies` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `failed_jobs`
--

DROP TABLE IF EXISTS `failed_jobs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `failed_jobs` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `uuid` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `failed_jobs`
--

LOCK TABLES `failed_jobs` WRITE;
/*!40000 ALTER TABLE `failed_jobs` DISABLE KEYS */;
/*!40000 ALTER TABLE `failed_jobs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `job_batches`
--

DROP TABLE IF EXISTS `job_batches`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `job_batches` (
  `id` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `total_jobs` int NOT NULL,
  `pending_jobs` int NOT NULL,
  `failed_jobs` int NOT NULL,
  `failed_job_ids` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `options` mediumtext COLLATE utf8mb4_unicode_ci,
  `cancelled_at` int DEFAULT NULL,
  `created_at` int NOT NULL,
  `finished_at` int DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `job_batches`
--

LOCK TABLES `job_batches` WRITE;
/*!40000 ALTER TABLE `job_batches` DISABLE KEYS */;
/*!40000 ALTER TABLE `job_batches` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jobs`
--

DROP TABLE IF EXISTS `jobs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `jobs` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `queue` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `attempts` tinyint unsigned NOT NULL,
  `reserved_at` int unsigned DEFAULT NULL,
  `available_at` int unsigned NOT NULL,
  `created_at` int unsigned NOT NULL,
  PRIMARY KEY (`id`),
  KEY `jobs_queue_index` (`queue`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jobs`
--

LOCK TABLES `jobs` WRITE;
/*!40000 ALTER TABLE `jobs` DISABLE KEYS */;
/*!40000 ALTER TABLE `jobs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `migrations`
--

DROP TABLE IF EXISTS `migrations`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `migrations` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `migrations`
--

LOCK TABLES `migrations` WRITE;
/*!40000 ALTER TABLE `migrations` DISABLE KEYS */;
INSERT INTO `migrations` VALUES (1,'0001_01_01_000000_create_users_table',1),(2,'0001_01_01_000001_create_cache_table',1),(3,'0001_01_01_000002_create_jobs_table',1),(4,'2024_01_01_000001_create_currencies_table',1),(5,'2024_01_01_000002_create_people_table',1),(6,'2024_01_01_000003_create_accounts_table',1),(7,'2024_01_01_000004_create_transactions_table',1);
/*!40000 ALTER TABLE `migrations` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `password_reset_tokens`
--

DROP TABLE IF EXISTS `password_reset_tokens`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `password_reset_tokens` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`email`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `password_reset_tokens`
--

LOCK TABLES `password_reset_tokens` WRITE;
/*!40000 ALTER TABLE `password_reset_tokens` DISABLE KEYS */;
/*!40000 ALTER TABLE `password_reset_tokens` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `people`
--

DROP TABLE IF EXISTS `people`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `people` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=41 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `people`
--

LOCK TABLES `people` WRITE;
/*!40000 ALTER TABLE `people` DISABLE KEYS */;
INSERT INTO `people` VALUES (1,'حسابي','2025-06-16 19:51:45','2025-06-16 19:51:45'),(2,'كرم','2025-06-16 19:52:33','2025-06-16 19:52:33'),(4,'حبيبتي','2025-06-16 19:53:41','2025-06-16 19:53:41'),(6,'عبدالله وردي','2025-06-16 19:54:25','2025-06-16 19:54:25'),(8,'سارية','2025-06-17 14:30:14','2025-06-17 14:30:14'),(14,'جعفر','2025-07-02 09:22:23','2025-07-02 09:22:23'),(19,'عمو شهير','2025-09-12 15:41:55','2025-09-12 15:41:55'),(23,'سارية دين','2025-10-28 21:38:04','2025-10-28 21:38:04'),(25,'خالو علي','2025-12-22 16:59:14','2025-12-22 16:59:14'),(29,'ابي','2026-01-20 09:09:14','2026-01-20 09:09:14'),(31,'زكاه','2026-03-03 21:44:29','2026-03-03 21:44:29'),(32,'بابا تركيا','2026-03-14 21:14:27','2026-04-30 08:58:37'),(36,'بابا سوريا','2026-04-30 08:58:51','2026-04-30 08:58:51');
/*!40000 ALTER TABLE `people` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `sessions`
--

DROP TABLE IF EXISTS `sessions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `sessions` (
  `id` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_id` bigint unsigned DEFAULT NULL,
  `ip_address` varchar(45) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `user_agent` text COLLATE utf8mb4_unicode_ci,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `last_activity` int NOT NULL,
  PRIMARY KEY (`id`),
  KEY `sessions_user_id_index` (`user_id`),
  KEY `sessions_last_activity_index` (`last_activity`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `sessions`
--

LOCK TABLES `sessions` WRITE;
/*!40000 ALTER TABLE `sessions` DISABLE KEYS */;
/*!40000 ALTER TABLE `sessions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `transactions`
--

DROP TABLE IF EXISTS `transactions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `transactions` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `account_id` bigint unsigned NOT NULL,
  `type` enum('deposit','withdrawal') COLLATE utf8mb4_unicode_ci NOT NULL,
  `amount` decimal(15,2) NOT NULL,
  `balance_before` decimal(15,2) NOT NULL,
  `balance_after` decimal(15,2) NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `transactions_account_id_foreign` (`account_id`),
  CONSTRAINT `transactions_account_id_foreign` FOREIGN KEY (`account_id`) REFERENCES `accounts` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=537 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `transactions`
--

LOCK TABLES `transactions` WRITE;
/*!40000 ALTER TABLE `transactions` DISABLE KEYS */;
INSERT INTO `transactions` VALUES (1,1,'deposit',12855.00,0.00,12855.00,NULL,'2025-06-16 19:52:00','2025-06-16 19:52:00'),(2,1,'deposit',50.00,12855.00,12905.00,NULL,'2025-06-16 19:52:05','2025-06-16 19:52:05'),(3,1,'withdrawal',300.00,12905.00,12605.00,NULL,'2025-06-16 19:52:09','2025-06-16 19:52:09'),(4,1,'deposit',100.00,12605.00,12705.00,NULL,'2025-06-16 19:52:12','2025-06-16 19:52:12'),(5,1,'withdrawal',200.00,12705.00,12505.00,NULL,'2025-06-16 19:52:17','2025-06-16 19:52:17'),(6,1,'withdrawal',200.00,12505.00,12305.00,NULL,'2025-06-16 19:52:17','2025-06-16 19:52:17'),(7,1,'deposit',200.00,12305.00,12505.00,NULL,'2025-06-16 19:52:23','2025-06-16 19:52:23'),(8,2,'deposit',815.00,0.00,815.00,NULL,'2025-06-16 19:52:40','2025-06-16 19:52:40'),(9,2,'withdrawal',200.00,815.00,615.00,NULL,'2025-06-16 19:52:44','2025-06-16 19:52:44'),(10,2,'deposit',80.00,615.00,695.00,NULL,'2025-06-16 19:52:47','2025-06-16 19:52:47'),(11,2,'deposit',985.00,695.00,1680.00,NULL,'2025-06-16 19:52:51','2025-06-16 19:52:51'),(12,2,'withdrawal',240.00,1680.00,1440.00,NULL,'2025-06-16 19:52:55','2025-06-16 19:52:55'),(13,2,'withdrawal',100.00,1440.00,1340.00,NULL,'2025-06-16 19:52:57','2025-06-16 19:52:57'),(14,2,'withdrawal',140.00,1340.00,1200.00,NULL,'2025-06-16 19:53:00','2025-06-16 19:53:00'),(15,2,'withdrawal',250.00,1200.00,950.00,NULL,'2025-06-16 19:53:04','2025-06-16 19:53:04'),(17,4,'deposit',290.00,0.00,290.00,NULL,'2025-06-16 19:53:47','2025-06-16 19:53:47'),(18,4,'deposit',230.00,290.00,520.00,NULL,'2025-06-16 19:53:51','2025-06-16 19:53:51'),(19,4,'withdrawal',30.00,520.00,490.00,NULL,'2025-06-16 19:53:53','2025-06-16 19:53:53'),(20,4,'deposit',250.00,490.00,740.00,NULL,'2025-06-16 19:53:56','2025-06-16 19:53:56'),(21,4,'withdrawal',90.00,740.00,650.00,NULL,'2025-06-16 19:53:58','2025-06-16 19:53:58'),(23,6,'deposit',400.00,0.00,400.00,NULL,'2025-06-16 19:54:30','2025-06-16 19:54:30'),(36,8,'deposit',5000.00,0.00,5000.00,NULL,'2025-06-17 14:30:21','2025-06-17 14:30:21'),(49,1,'withdrawal',300.00,12505.00,12205.00,NULL,'2025-06-23 12:44:29','2025-06-23 12:44:29'),(54,1,'deposit',400.00,12205.00,12605.00,NULL,'2025-06-30 08:46:56','2025-06-30 08:46:56'),(59,15,'deposit',500.00,0.00,500.00,NULL,'2025-07-02 09:22:29','2025-07-02 09:22:29'),(64,15,'deposit',1000.00,500.00,1500.00,NULL,'2025-07-02 20:38:16','2025-07-02 20:38:16'),(66,1,'deposit',500.00,12605.00,13105.00,NULL,'2025-07-03 11:32:59','2025-07-03 11:32:59'),(68,1,'withdrawal',105.00,13105.00,13000.00,NULL,'2025-07-04 12:15:58','2025-07-04 12:15:58'),(69,2,'withdrawal',400.00,950.00,550.00,NULL,'2025-07-06 11:58:29','2025-07-06 11:58:29'),(70,1,'withdrawal',200.00,13000.00,12800.00,NULL,'2025-07-06 12:11:49','2025-07-06 12:11:49'),(71,1,'withdrawal',300.00,12800.00,12500.00,NULL,'2025-07-06 13:16:50','2025-07-06 13:16:50'),(72,1,'deposit',180.00,12500.00,12680.00,NULL,'2025-07-09 08:23:08','2025-07-09 08:23:08'),(73,1,'deposit',200.00,12680.00,12880.00,NULL,'2025-07-09 17:07:34','2025-07-09 17:07:34'),(74,1,'deposit',330.00,12880.00,13210.00,NULL,'2025-07-09 17:07:39','2025-07-09 17:07:39'),(75,6,'withdrawal',400.00,400.00,0.00,NULL,'2025-07-09 22:48:56','2025-07-09 22:48:56'),(76,15,'withdrawal',1500.00,1500.00,0.00,NULL,'2025-07-10 09:11:23','2025-07-10 09:11:23'),(77,1,'withdrawal',300.00,13210.00,12910.00,NULL,'2025-07-10 22:18:27','2025-07-10 22:18:27'),(84,15,'deposit',400.00,0.00,400.00,NULL,'2025-07-11 14:23:14','2025-07-11 14:23:14'),(87,15,'withdrawal',400.00,400.00,0.00,NULL,'2025-07-11 20:40:38','2025-07-11 20:40:38'),(90,1,'withdrawal',100.00,12910.00,12810.00,NULL,'2025-07-11 20:41:26','2025-07-11 20:41:26'),(95,1,'deposit',40.00,12810.00,12850.00,NULL,'2025-07-13 17:23:13','2025-07-13 17:23:13'),(96,1,'withdrawal',100.00,12850.00,12750.00,NULL,'2025-07-14 14:45:35','2025-07-14 14:45:35'),(97,1,'deposit',1000.00,12750.00,13750.00,NULL,'2025-07-14 16:36:16','2025-07-14 16:36:16'),(100,1,'deposit',300.00,13750.00,14050.00,NULL,'2025-07-16 08:02:40','2025-07-16 08:02:40'),(104,2,'withdrawal',13.00,550.00,537.00,NULL,'2025-07-21 14:06:47','2025-07-21 14:06:47'),(122,15,'deposit',500.00,0.00,500.00,NULL,'2025-08-04 17:42:47','2025-08-04 17:42:47'),(126,1,'deposit',200.00,14050.00,14250.00,NULL,'2025-08-04 18:46:11','2025-08-04 18:46:11'),(128,1,'withdrawal',110.00,14250.00,14140.00,NULL,'2025-08-05 16:38:35','2025-08-05 16:38:35'),(129,1,'withdrawal',50.00,14140.00,14090.00,'الدية','2025-08-06 11:08:18','2025-08-06 11:08:18'),(130,2,'withdrawal',50.00,537.00,487.00,'الدية','2025-08-06 11:08:29','2025-08-06 11:08:29'),(131,15,'deposit',1000.00,500.00,1500.00,NULL,'2025-08-06 12:12:01','2025-08-06 12:12:01'),(138,1,'deposit',330.00,14090.00,14420.00,NULL,'2025-08-08 11:15:18','2025-08-08 11:15:18'),(141,1,'withdrawal',320.00,14420.00,14100.00,NULL,'2025-08-11 00:00:41','2025-08-11 00:00:41'),(149,8,'deposit',375.00,5000.00,5375.00,'أرباح دورة ٤ ٥ ٦','2025-08-11 16:54:31','2025-08-11 16:54:31'),(151,1,'withdrawal',170.00,14100.00,13930.00,NULL,'2025-08-17 16:43:29','2025-08-17 16:43:29'),(154,15,'deposit',50.00,1500.00,1550.00,NULL,'2025-08-18 11:09:10','2025-08-18 11:09:10'),(155,26,'deposit',1000.00,0.00,1000.00,'لعميمة روعة','2025-08-18 11:09:32','2025-08-18 11:09:32'),(158,1,'deposit',1400.00,13930.00,15330.00,NULL,'2025-08-18 15:36:23','2025-08-18 15:36:23'),(159,1,'withdrawal',200.00,15330.00,15130.00,NULL,'2025-08-18 23:44:11','2025-08-18 23:44:11'),(160,1,'withdrawal',200.00,15130.00,14930.00,NULL,'2025-08-21 20:08:53','2025-08-21 20:08:53'),(161,1,'deposit',400.00,14930.00,15330.00,NULL,'2025-08-23 09:20:46','2025-08-23 09:20:46'),(162,1,'withdrawal',300.00,15330.00,15030.00,NULL,'2025-08-23 16:57:28','2025-08-23 16:57:28'),(166,15,'deposit',3000.00,1550.00,4550.00,NULL,'2025-08-30 13:24:12','2025-08-30 13:24:12'),(167,1,'deposit',25.00,15030.00,15055.00,NULL,'2025-08-31 00:27:48','2025-08-31 00:27:48'),(168,1,'deposit',145.00,15055.00,15200.00,NULL,'2025-09-01 13:58:35','2025-09-01 13:58:35'),(175,15,'deposit',1800.00,4550.00,6350.00,NULL,'2025-09-04 13:34:12','2025-09-04 13:34:12'),(179,26,'withdrawal',1000.00,1000.00,0.00,NULL,'2025-09-05 21:46:24','2025-09-05 21:46:24'),(180,6,'deposit',400.00,0.00,400.00,NULL,'2025-09-05 21:47:07','2025-09-05 21:47:07'),(181,8,'deposit',5000.00,5375.00,10375.00,NULL,'2025-09-05 21:47:23','2025-09-05 21:47:23'),(183,1,'deposit',300.00,15200.00,15500.00,NULL,'2025-09-08 13:29:54','2025-09-08 13:29:54'),(185,1,'withdrawal',20.00,15500.00,15480.00,NULL,'2025-09-10 10:54:52','2025-09-10 10:54:52'),(186,2,'withdrawal',40.00,487.00,447.00,NULL,'2025-09-10 10:55:27','2025-09-10 10:55:27'),(187,1,'withdrawal',80.00,15480.00,15400.00,NULL,'2025-09-10 12:49:59','2025-09-10 12:49:59'),(188,2,'deposit',20.00,447.00,467.00,NULL,'2025-09-10 15:28:48','2025-09-10 15:28:48'),(189,2,'deposit',810.00,467.00,1277.00,'810.671','2025-09-11 11:07:19','2025-09-11 11:07:19'),(191,2,'deposit',250.00,1277.00,1527.00,NULL,'2025-09-11 13:00:30','2025-09-11 13:00:30'),(195,2,'deposit',4000.00,1527.00,5527.00,NULL,'2025-09-12 08:46:13','2025-09-12 08:46:13'),(196,1,'deposit',1100.00,15400.00,16500.00,NULL,'2025-09-12 14:58:26','2025-09-12 14:58:26'),(198,27,'deposit',27295.00,0.00,27295.00,NULL,'2025-09-12 15:42:17','2025-09-12 15:42:17'),(199,27,'deposit',2000.00,27295.00,29295.00,'الي كانت باسمي','2025-09-12 15:42:27','2025-09-12 15:42:27'),(200,27,'withdrawal',2000.00,29295.00,27295.00,'21/3/2023','2025-09-12 15:42:42','2025-09-12 15:42:42'),(201,27,'withdrawal',1000.00,27295.00,26295.00,'1/4/2023','2025-09-12 15:42:52','2025-09-12 15:42:52'),(202,27,'withdrawal',1000.00,26295.00,25295.00,'11/4/2023','2025-09-12 15:43:01','2025-09-12 15:43:01'),(203,27,'withdrawal',2000.00,25295.00,23295.00,'20/03/2025','2025-09-12 15:43:24','2025-09-12 15:43:24'),(204,27,'withdrawal',3000.00,23295.00,20295.00,'12/9/2025','2025-09-12 15:43:35','2025-09-12 15:43:35'),(205,2,'withdrawal',5000.00,5527.00,527.00,NULL,'2025-09-12 16:21:56','2025-09-12 16:21:56'),(208,1,'deposit',310.00,16500.00,16810.00,NULL,'2025-09-15 11:39:22','2025-09-15 11:39:22'),(209,1,'withdrawal',390.00,16810.00,16420.00,NULL,'2025-09-15 12:58:40','2025-09-15 12:58:40'),(210,2,'deposit',694.00,527.00,1221.00,NULL,'2025-09-15 13:28:28','2025-09-15 13:28:28'),(212,2,'deposit',272.00,1221.00,1493.00,NULL,'2025-09-15 19:15:17','2025-09-15 19:15:17'),(213,29,'deposit',10000.00,0.00,10000.00,NULL,'2025-09-15 19:21:25','2025-09-15 19:21:25'),(215,6,'deposit',244.00,400.00,644.00,NULL,'2025-09-15 19:27:55','2025-09-15 19:27:55'),(216,29,'withdrawal',10000.00,10000.00,0.00,NULL,'2025-09-15 19:28:04','2025-09-15 19:28:04'),(217,6,'deposit',256.00,644.00,900.00,NULL,'2025-09-17 13:52:23','2025-09-17 13:52:23'),(218,2,'deposit',682.00,1493.00,2175.00,NULL,'2025-09-17 13:54:30','2025-09-17 13:54:30'),(219,1,'withdrawal',700.00,16420.00,15720.00,NULL,'2025-09-18 13:23:51','2025-09-18 13:23:51'),(220,1,'withdrawal',20.00,15720.00,15700.00,NULL,'2025-09-18 13:24:08','2025-09-18 13:24:08'),(222,1,'withdrawal',36.00,15700.00,15664.00,NULL,'2025-09-18 21:36:38','2025-09-18 21:36:38'),(223,15,'withdrawal',3000.00,6350.00,3350.00,NULL,'2025-09-19 20:18:15','2025-09-19 20:18:15'),(228,1,'withdrawal',16.00,15664.00,15648.00,NULL,'2025-09-23 13:34:48','2025-09-23 13:34:48'),(229,1,'deposit',2.00,15648.00,15650.00,NULL,'2025-09-23 13:34:55','2025-09-23 13:34:55'),(236,1,'deposit',300.00,15650.00,15950.00,NULL,'2025-09-24 17:25:34','2025-09-24 17:25:34'),(239,1,'deposit',235.00,15950.00,16185.00,NULL,'2025-09-25 12:07:59','2025-09-25 12:07:59'),(242,2,'deposit',66.00,2175.00,2241.00,NULL,'2025-09-28 21:48:08','2025-09-28 21:48:08'),(247,1,'withdrawal',85.00,16185.00,16100.00,NULL,'2025-10-01 12:12:23','2025-10-01 12:12:23'),(249,1,'deposit',100.00,16100.00,16200.00,NULL,'2025-10-01 17:08:43','2025-10-01 17:08:43'),(255,1,'withdrawal',135.00,16200.00,16065.00,NULL,'2025-10-06 18:57:40','2025-10-06 18:57:40'),(261,6,'deposit',116.00,900.00,1016.00,'سمنة','2025-10-13 21:33:11','2025-10-13 21:33:11'),(262,15,'deposit',1000.00,3350.00,4350.00,NULL,'2025-10-19 20:52:46','2025-10-19 20:52:46'),(263,1,'deposit',1100.00,16065.00,17165.00,NULL,'2025-10-20 23:15:04','2025-10-20 23:15:04'),(268,1,'withdrawal',15.00,17165.00,17150.00,NULL,'2025-10-23 23:28:23','2025-10-23 23:28:23'),(269,1,'withdrawal',1000.00,17150.00,16150.00,NULL,'2025-10-26 22:48:00','2025-10-26 22:48:00'),(271,34,'deposit',3000.00,0.00,3000.00,NULL,'2025-10-28 21:38:14','2025-10-28 21:38:14'),(274,1,'withdrawal',50.00,16150.00,16100.00,NULL,'2025-10-30 23:00:42','2025-10-30 23:00:42'),(276,15,'deposit',375.00,4350.00,4725.00,NULL,'2025-11-01 08:36:19','2025-11-01 08:36:19'),(278,1,'withdrawal',490.00,16100.00,15610.00,NULL,'2025-11-04 16:26:06','2025-11-04 16:26:06'),(280,15,'withdrawal',3400.00,4725.00,1325.00,NULL,'2025-11-06 22:11:46','2025-11-06 22:11:46'),(281,1,'deposit',1100.00,15610.00,16710.00,NULL,'2025-11-11 14:19:48','2025-11-11 14:19:48'),(282,2,'deposit',70.00,2241.00,2311.00,NULL,'2025-11-11 18:19:59','2025-11-11 18:19:59'),(283,8,'deposit',420.00,10375.00,10795.00,NULL,'2025-11-11 18:20:30','2025-11-11 18:20:30'),(284,8,'deposit',140.00,10795.00,10935.00,NULL,'2025-11-11 18:20:45','2025-11-11 18:20:45'),(286,2,'deposit',67.00,2311.00,2378.00,NULL,'2025-11-14 13:15:27','2025-11-14 13:15:27'),(287,2,'deposit',20.00,2378.00,2398.00,NULL,'2025-11-15 23:36:09','2025-11-15 23:36:09'),(291,34,'withdrawal',3000.00,3000.00,0.00,NULL,'2025-11-17 14:04:07','2025-11-17 14:04:07'),(292,6,'withdrawal',600.00,1016.00,416.00,NULL,'2025-11-17 14:04:15','2025-11-17 14:04:15'),(293,15,'deposit',1000.00,1325.00,2325.00,NULL,'2025-11-17 14:04:25','2025-11-17 14:04:25'),(295,1,'deposit',600.00,16710.00,17310.00,NULL,'2025-11-17 14:04:57','2025-11-17 14:04:57'),(298,36,'deposit',600000.00,0.00,600000.00,'تبع زكريا شهر ١١','2025-11-19 13:50:14','2025-11-19 13:50:14'),(301,1,'deposit',700.00,17310.00,18010.00,NULL,'2025-11-21 10:56:28','2025-11-21 10:56:28'),(302,15,'withdrawal',1872.00,2325.00,453.00,'من محمد عزيز','2025-11-24 19:50:59','2025-11-24 19:50:59'),(303,1,'deposit',100.00,18010.00,18110.00,'نقوط من ابو فاروق','2025-11-24 19:52:34','2025-11-24 19:52:34'),(304,34,'deposit',1005.00,0.00,1005.00,'مرابح','2025-11-24 19:55:18','2025-11-24 19:55:18'),(305,8,'withdrawal',935.00,10935.00,10000.00,NULL,'2025-11-24 19:55:43','2025-11-24 19:55:43'),(306,1,'deposit',200.00,18110.00,18310.00,NULL,'2025-11-28 17:05:10','2025-11-28 17:05:10'),(308,1,'withdrawal',3100.00,18310.00,15210.00,'اجار البيت','2025-12-02 11:33:00','2025-12-02 11:33:00'),(309,1,'withdrawal',100.00,15210.00,15110.00,NULL,'2025-12-03 14:37:07','2025-12-03 14:37:07'),(310,1,'withdrawal',200.00,15110.00,14910.00,'لماما دين','2025-12-05 17:17:34','2025-12-05 17:17:34'),(311,1,'withdrawal',200.00,14910.00,14710.00,'صرفتوها بقدسيا ع ١٢','2025-12-05 17:17:47','2025-12-05 17:17:47'),(314,1,'deposit',500.00,14710.00,15210.00,'من طه الحمدان','2025-12-05 17:18:39','2025-12-05 17:18:39'),(316,1,'deposit',750.00,15210.00,15960.00,NULL,'2025-12-13 12:34:59','2025-12-13 12:34:59'),(317,15,'withdrawal',453.00,453.00,0.00,NULL,'2025-12-13 12:35:50','2025-12-13 12:35:50'),(318,15,'deposit',247.00,0.00,247.00,'لجعفر الباقي من ال٧٠٠','2025-12-13 12:36:09','2025-12-13 12:36:09'),(319,2,'withdrawal',240.00,2398.00,2158.00,NULL,'2025-12-13 18:33:40','2025-12-13 18:33:40'),(320,2,'withdrawal',60.00,2158.00,2098.00,NULL,'2025-12-14 08:18:08','2025-12-14 08:18:08'),(321,36,'deposit',300000.00,600000.00,900000.00,NULL,'2025-12-15 11:11:39','2025-12-15 11:11:39'),(322,36,'deposit',300000.00,900000.00,1200000.00,NULL,'2025-12-15 11:15:21','2025-12-15 11:15:21'),(323,1,'deposit',1100.00,15960.00,17060.00,NULL,'2025-12-16 20:47:33','2025-12-16 20:47:33'),(324,1,'deposit',330.00,17060.00,17390.00,NULL,'2025-12-16 20:47:38','2025-12-16 20:47:38'),(325,1,'withdrawal',90.00,17390.00,17300.00,NULL,'2025-12-16 20:47:46','2025-12-16 20:47:46'),(326,34,'withdrawal',600.00,1005.00,405.00,'دفعة','2025-12-21 12:12:28','2025-12-21 12:12:28'),(327,1,'withdrawal',17300.00,17300.00,0.00,'تصفير حساب بعد شراء السيارة','2025-12-21 12:13:05','2025-12-21 12:13:05'),(328,15,'withdrawal',247.00,247.00,0.00,NULL,'2025-12-21 20:13:40','2025-12-21 20:13:40'),(329,37,'deposit',800.00,0.00,800.00,NULL,'2025-12-22 16:59:23','2025-12-22 16:59:23'),(330,15,'deposit',100.00,0.00,100.00,'حولناها ع جديدة عرطوز','2025-12-22 16:59:56','2025-12-22 16:59:56'),(332,2,'deposit',100.00,2098.00,2198.00,NULL,'2025-12-25 10:09:32','2025-12-25 10:09:32'),(333,15,'withdrawal',100.00,100.00,0.00,NULL,'2025-12-25 10:09:44','2025-12-25 10:09:44'),(335,2,'deposit',100.00,2198.00,2298.00,NULL,'2025-12-26 13:19:36','2025-12-26 13:19:36'),(336,36,'deposit',300000.00,1200000.00,1500000.00,NULL,'2026-01-01 15:48:35','2026-01-01 15:48:35'),(337,6,'deposit',100.00,416.00,516.00,'حولتها لعمران','2026-01-04 07:26:36','2026-01-04 07:26:36'),(338,36,'deposit',1000000.00,1500000.00,2500000.00,'لسامر الدبس','2026-01-04 07:26:50','2026-01-04 07:26:50'),(341,36,'deposit',1000000.00,2500000.00,3500000.00,NULL,'2026-01-06 10:53:32','2026-01-06 10:53:32'),(342,36,'withdrawal',2000000.00,3500000.00,1500000.00,NULL,'2026-01-06 10:53:51','2026-01-06 10:53:51'),(343,6,'withdrawal',100.00,516.00,416.00,NULL,'2026-01-06 10:54:04','2026-01-06 10:54:04'),(344,34,'deposit',1026.00,405.00,1431.00,'دورة ١٠ ١١ ١٢','2026-01-06 19:06:28','2026-01-06 19:06:28'),(345,34,'withdrawal',150.00,1431.00,1281.00,'دفعة من الارباح','2026-01-06 19:07:22','2026-01-06 19:07:22'),(346,34,'withdrawal',1.00,1281.00,1280.00,NULL,'2026-01-06 19:07:48','2026-01-06 19:07:48'),(347,2,'deposit',342.00,2298.00,2640.00,'ارباح سارية','2026-01-06 19:08:50','2026-01-06 19:08:50'),(348,6,'withdrawal',416.00,416.00,0.00,NULL,'2026-01-08 06:50:32','2026-01-08 06:50:32'),(349,36,'withdrawal',1100000.00,1500000.00,400000.00,NULL,'2026-01-08 06:50:50','2026-01-08 06:50:50'),(352,34,'withdrawal',80.00,1280.00,1200.00,NULL,'2026-01-10 11:38:07','2026-01-10 11:38:07'),(353,27,'withdrawal',2000.00,20295.00,18295.00,'15/12/2025','2026-01-11 16:47:02','2026-01-11 16:47:02'),(354,27,'withdrawal',1000.00,18295.00,17295.00,'22/12/2025','2026-01-11 17:24:07','2026-01-11 17:24:07'),(355,36,'deposit',300000.00,400000.00,700000.00,'زكريا','2026-01-20 09:06:58','2026-01-20 09:06:58'),(356,34,'withdrawal',200.00,1200.00,1000.00,NULL,'2026-01-20 09:07:22','2026-01-20 09:07:22'),(361,43,'deposit',4500.00,0.00,4500.00,NULL,'2026-01-20 09:09:42','2026-01-20 09:09:42'),(362,43,'deposit',450.00,4500.00,4950.00,'من احمد كريم','2026-01-20 09:10:09','2026-01-20 09:10:09'),(363,44,'deposit',1000000.00,0.00,1000000.00,NULL,'2026-01-22 11:02:23','2026-01-22 11:02:23'),(366,43,'deposit',330.00,4950.00,5280.00,'من عندي','2026-01-22 15:19:01','2026-01-22 15:19:01'),(367,43,'withdrawal',500.00,5280.00,4780.00,NULL,'2026-01-22 15:22:20','2026-01-22 15:22:20'),(371,15,'withdrawal',11450.00,0.00,-11450.00,NULL,'2026-01-27 08:03:28','2026-01-27 08:03:28'),(372,4,'withdrawal',650.00,650.00,0.00,NULL,'2026-01-27 08:03:41','2026-01-27 08:03:41'),(373,4,'withdrawal',650.00,0.00,-650.00,NULL,'2026-01-27 08:03:44','2026-01-27 08:03:44'),(374,2,'withdrawal',2640.00,2640.00,0.00,NULL,'2026-01-27 08:03:56','2026-01-27 08:03:56'),(375,2,'withdrawal',2640.00,0.00,-2640.00,NULL,'2026-01-27 08:04:00','2026-01-27 08:04:00'),(376,27,'withdrawal',1500.00,17295.00,15795.00,'دفعة بتاريخ 2026/01/27 بيد ابي','2026-01-27 13:22:39','2026-01-27 13:22:39'),(377,43,'deposit',1500.00,4780.00,6280.00,'من عمو شهير','2026-01-27 13:22:53','2026-01-27 13:22:53'),(378,36,'deposit',300000.00,700000.00,1000000.00,'زكريا','2026-02-02 16:49:27','2026-02-02 16:49:27'),(379,44,'deposit',160000.00,1000000.00,1160000.00,'وحدات','2026-02-11 20:32:57','2026-02-11 20:32:57'),(381,34,'withdrawal',400.00,1000.00,600.00,NULL,'2026-02-13 13:49:03','2026-02-13 13:49:03'),(382,15,'deposit',11450.00,-11450.00,0.00,NULL,'2026-02-13 17:17:17','2026-02-13 17:17:17'),(383,44,'withdrawal',1160000.00,1160000.00,0.00,NULL,'2026-02-13 17:17:35','2026-02-13 17:17:35'),(384,4,'deposit',120.00,-650.00,-530.00,NULL,'2026-02-15 21:31:30','2026-02-15 21:31:30'),(385,43,'deposit',1200.00,6280.00,7480.00,NULL,'2026-02-15 22:36:38','2026-02-15 22:36:38'),(386,36,'deposit',300000.00,1000000.00,1300000.00,'زكريا','2026-02-16 16:21:20','2026-02-16 16:21:20'),(387,44,'withdrawal',250000.00,0.00,-250000.00,'غيار زيت','2026-02-21 16:16:10','2026-02-21 16:16:10'),(388,34,'withdrawal',150.00,600.00,450.00,NULL,'2026-02-23 22:39:02','2026-02-23 22:39:02'),(389,36,'deposit',300000.00,1300000.00,1600000.00,'زكريا','2026-03-02 19:01:50','2026-03-02 19:01:50'),(390,15,'deposit',1000.00,0.00,1000.00,'زكاة','2026-03-03 19:24:42','2026-03-03 19:24:42'),(391,15,'deposit',300.00,1000.00,1300.00,'تطوير موقع','2026-03-03 19:24:52','2026-03-03 19:24:52'),(392,43,'deposit',430.00,7480.00,7910.00,NULL,'2026-03-03 21:43:48','2026-03-03 21:43:48'),(393,43,'deposit',150.00,7910.00,8060.00,NULL,'2026-03-03 22:03:41','2026-03-03 22:03:41'),(394,27,'withdrawal',1500.00,15795.00,14295.00,'2026/03/04 15رمضان','2026-03-04 23:13:34','2026-03-04 23:13:34'),(395,43,'deposit',1500.00,8060.00,9560.00,NULL,'2026-03-04 23:13:54','2026-03-04 23:13:54'),(396,36,'deposit',300000.00,1600000.00,1900000.00,'زكريا','2026-03-05 17:20:13','2026-03-05 17:20:13'),(397,43,'deposit',300.00,9560.00,9860.00,NULL,'2026-03-06 13:45:31','2026-03-06 13:45:31'),(398,15,'deposit',100.00,1300.00,1400.00,'كمالة الزكاة','2026-03-07 13:08:30','2026-03-07 13:08:30'),(399,34,'withdrawal',300.00,450.00,150.00,NULL,'2026-03-08 22:08:56','2026-03-08 22:08:56'),(400,15,'deposit',100.00,1400.00,1500.00,'400 الي وال1100 لبابا','2026-03-10 11:41:17','2026-03-10 11:41:17'),(401,15,'deposit',300.00,1500.00,1800.00,'400 الي و1400 لبابا','2026-03-11 10:49:27','2026-03-11 10:49:27'),(402,15,'deposit',100.00,1800.00,1900.00,'400 الي و1500 لبابا','2026-03-12 13:02:20','2026-03-12 13:02:20'),(403,15,'deposit',300.00,1900.00,2200.00,'700 الي و1500 لبابا','2026-03-14 21:14:09','2026-03-14 21:14:09'),(404,46,'withdrawal',600.00,0.00,-600.00,'من احمد كريم','2026-03-14 21:14:43','2026-03-14 21:14:43'),(405,27,'withdrawal',2000.00,14295.00,12295.00,'2026/03/12 بيد ابي','2026-03-14 21:17:33','2026-03-14 21:17:33'),(406,15,'deposit',80.00,2200.00,2280.00,'700 الي و1580 لبابا','2026-03-15 10:25:07','2026-03-15 10:25:07'),(407,36,'deposit',300000.00,1900000.00,2200000.00,'زكريا','2026-03-17 21:13:16','2026-03-17 21:13:16'),(408,46,'deposit',380.00,-600.00,-220.00,NULL,'2026-03-20 16:19:11','2026-03-20 16:19:11'),(409,46,'withdrawal',380.00,-220.00,-600.00,NULL,'2026-03-20 16:19:19','2026-03-20 16:19:19'),(410,46,'withdrawal',380.00,-600.00,-980.00,NULL,'2026-03-20 16:19:25','2026-03-20 16:19:25'),(411,27,'withdrawal',2500.00,12295.00,9795.00,'2026/03/24 بيد ابي','2026-03-24 16:45:04','2026-03-24 16:45:04'),(413,36,'deposit',300000.00,2200000.00,2500000.00,'زكريا','2026-04-02 18:27:02','2026-04-02 18:27:02'),(415,46,'withdrawal',950.00,-980.00,-1930.00,'من احمد كريم','2026-04-06 15:07:57','2026-04-06 15:07:57'),(418,27,'withdrawal',1000.00,9795.00,8795.00,'2026/04/13 بيد ابي','2026-04-13 12:11:51','2026-04-13 12:11:51'),(432,34,'withdrawal',300.00,150.00,-150.00,NULL,'2026-04-13 19:46:01','2026-04-13 19:46:01'),(433,15,'deposit',80.00,2280.00,2360.00,'بانزين','2026-04-14 15:38:43','2026-04-14 15:38:43'),(434,36,'deposit',300000.00,2500000.00,2800000.00,'زكريا','2026-04-15 18:51:24','2026-04-15 18:51:24'),(435,46,'withdrawal',330.00,-1930.00,-2260.00,NULL,'2026-04-18 17:19:17','2026-04-18 17:19:17'),(436,2,'withdrawal',315.00,-2640.00,-2955.00,'ارباح الدورة الاولى ٢٠٢٦ من سارية','2026-04-20 16:37:29','2026-04-20 16:37:29'),(437,34,'deposit',945.00,-150.00,795.00,'مرابح الدورة الاولى ٢٠٢٦','2026-04-20 16:38:08','2026-04-20 16:38:08'),(438,15,'deposit',200.00,2360.00,2560.00,NULL,'2026-04-21 18:28:55','2026-04-21 18:28:55'),(439,46,'withdrawal',100.00,-2260.00,-2360.00,NULL,'2026-04-27 08:35:31','2026-04-27 08:35:31'),(440,15,'deposit',500.00,2560.00,3060.00,NULL,'2026-04-29 18:47:19','2026-04-29 18:47:19'),(441,15,'deposit',300.00,3060.00,3360.00,NULL,'2026-04-29 18:50:54','2026-04-29 18:50:54'),(444,15,'withdrawal',3360.00,3360.00,0.00,NULL,'2026-04-29 18:52:31','2026-04-29 18:52:31'),(445,44,'deposit',250000.00,-250000.00,0.00,NULL,'2026-04-29 20:59:17','2026-04-29 20:59:17'),(446,34,'withdrawal',200.00,795.00,595.00,NULL,'2026-04-29 20:59:30','2026-04-29 20:59:30'),(447,46,'deposit',300.00,-2360.00,-2060.00,NULL,'2026-04-30 08:47:45','2026-04-30 08:47:45'),(448,46,'withdrawal',170.00,-2060.00,-2230.00,NULL,'2026-04-30 08:48:06','2026-04-30 08:48:06'),(449,46,'deposit',100.00,-2230.00,-2130.00,NULL,'2026-04-30 08:49:16','2026-04-30 08:49:16'),(450,46,'withdrawal',170.00,-2130.00,-2300.00,NULL,'2026-04-30 08:52:07','2026-04-30 08:52:07'),(451,46,'deposit',170.00,-2300.00,-2130.00,NULL,'2026-04-30 08:52:11','2026-04-30 08:52:11'),(452,46,'deposit',170.00,-2130.00,-1960.00,NULL,'2026-04-30 08:52:17','2026-04-30 08:52:17'),(453,46,'withdrawal',420.00,-1960.00,-2380.00,'في البركة','2026-04-30 08:52:30','2026-04-30 08:52:30'),(454,51,'deposit',2100.00,0.00,2100.00,NULL,'2026-04-30 08:59:13','2026-04-30 08:59:13'),(455,52,'deposit',50.00,0.00,50.00,'رقية','2026-04-30 08:59:34','2026-04-30 08:59:34'),(456,1,'deposit',4445.00,0.00,4445.00,NULL,'2026-04-30 09:03:29','2026-04-30 09:03:29'),(457,15,'deposit',110000.00,0.00,110000.00,NULL,'2026-05-04 08:26:16','2026-05-04 08:26:16'),(458,15,'withdrawal',110000.00,110000.00,0.00,NULL,'2026-05-04 08:26:21','2026-05-04 08:26:21'),(459,44,'deposit',110000.00,0.00,110000.00,NULL,'2026-05-04 08:26:29','2026-05-04 08:26:29'),(460,44,'deposit',75000.00,110000.00,185000.00,NULL,'2026-05-04 08:26:37','2026-05-04 08:26:37'),(461,36,'deposit',200000.00,2800000.00,3000000.00,NULL,'2026-05-04 09:17:26','2026-05-04 09:17:26'),(462,44,'deposit',75000.00,185000.00,260000.00,NULL,'2026-05-05 21:14:14','2026-05-05 21:14:14'),(463,51,'withdrawal',800.00,2100.00,1300.00,NULL,'2026-05-06 18:22:06','2026-05-06 18:22:06'),(464,46,'withdrawal',300.00,-2380.00,-2680.00,NULL,'2026-05-06 18:22:16','2026-05-06 18:22:16'),(469,46,'deposit',2680.00,-2680.00,0.00,NULL,'2026-05-06 20:59:26','2026-05-06 20:59:26'),(470,46,'withdrawal',27.00,0.00,-27.00,'270$ في البركة','2026-05-06 21:00:25','2026-05-06 21:00:25'),(471,46,'deposit',27.00,-27.00,0.00,NULL,'2026-05-06 21:00:30','2026-05-06 21:00:30'),(472,46,'withdrawal',2730.00,0.00,-2730.00,'270$ في البركة','2026-05-06 21:00:35','2026-05-06 21:00:35'),(473,1,'deposit',1800.00,4445.00,6245.00,NULL,'2026-05-06 21:03:49','2026-05-06 21:03:49'),(474,51,'withdrawal',100.00,1300.00,1200.00,NULL,'2026-05-06 21:03:58','2026-05-06 21:03:58'),(477,1,'withdrawal',200.00,6245.00,6045.00,'في جزداني مصروووف','2026-05-06 21:11:49','2026-05-06 21:11:49'),(478,1,'withdrawal',100.00,6045.00,5945.00,'دين لبلال','2026-05-06 21:11:58','2026-05-06 21:11:58'),(484,46,'deposit',230.00,-2730.00,-2500.00,'170$ في البركة','2026-05-11 18:56:35','2026-05-11 18:56:35'),(485,46,'withdrawal',230.00,-2500.00,-2730.00,NULL,'2026-05-11 18:56:47','2026-05-11 18:56:47'),(486,46,'withdrawal',230.00,-2730.00,-2960.00,NULL,'2026-05-11 18:56:52','2026-05-11 18:56:52'),(487,1,'deposit',200.00,5945.00,6145.00,NULL,'2026-05-11 18:58:18','2026-05-11 18:58:18'),(488,44,'deposit',500000.00,260000.00,760000.00,NULL,'2026-05-11 18:58:46','2026-05-11 18:58:46'),(489,36,'deposit',200000.00,3000000.00,3200000.00,'زكريا','2026-05-15 18:51:50','2026-05-15 18:51:50'),(490,15,'deposit',100.00,0.00,100.00,'عندي اله','2026-05-15 21:45:28','2026-05-15 21:45:28'),(491,37,'withdrawal',100.00,800.00,700.00,NULL,'2026-05-15 21:45:51','2026-05-15 21:45:51'),(492,51,'withdrawal',200.00,1200.00,1000.00,NULL,'2026-05-15 21:46:16','2026-05-15 21:46:16'),(494,34,'withdrawal',200.00,595.00,395.00,NULL,'2026-05-16 18:29:09','2026-05-16 18:29:09'),(495,15,'withdrawal',100.00,100.00,0.00,NULL,'2026-05-16 19:36:07','2026-05-16 19:36:07'),(496,44,'withdrawal',1350000.00,760000.00,-590000.00,NULL,'2026-05-16 19:39:18','2026-05-16 19:39:18'),(497,44,'deposit',200000.00,-590000.00,-390000.00,NULL,'2026-05-17 15:35:17','2026-05-17 15:35:17'),(498,44,'deposit',10000.00,-390000.00,-380000.00,NULL,'2026-05-17 15:35:32','2026-05-17 15:35:32'),(501,51,'withdrawal',100.00,1000.00,900.00,NULL,'2026-05-18 16:09:29','2026-05-18 16:09:29'),(502,46,'deposit',60.00,-2960.00,-2900.00,NULL,'2026-05-18 18:19:53','2026-05-18 18:19:53'),(503,36,'withdrawal',3200000.00,3200000.00,0.00,NULL,'2026-05-22 18:08:50','2026-05-22 18:08:50'),(504,44,'deposit',100000.00,-380000.00,-280000.00,NULL,'2026-05-22 18:09:12','2026-05-22 18:09:12'),(505,2,'deposit',600.00,-2955.00,-2355.00,'زكاة','2026-05-22 18:26:04','2026-05-22 18:26:04'),(506,2,'deposit',100.00,-2355.00,-2255.00,'زكاة','2026-05-22 18:33:16','2026-05-22 18:33:16'),(507,51,'deposit',16100.00,900.00,17000.00,NULL,'2026-05-30 14:02:46','2026-05-30 14:02:46'),(508,51,'deposit',800.00,17000.00,17800.00,NULL,'2026-05-30 14:02:57','2026-05-30 14:02:57'),(509,1,'withdrawal',1400.00,6145.00,4745.00,NULL,'2026-05-30 14:04:07','2026-05-30 14:04:07'),(510,36,'deposit',200000.00,0.00,200000.00,'زكريا','2026-06-02 17:53:45','2026-06-02 17:53:45'),(511,1,'deposit',300.00,4745.00,5045.00,'باقي من التامين','2026-06-11 17:56:05','2026-06-11 17:56:05'),(512,1,'deposit',400.00,5045.00,5445.00,NULL,'2026-06-14 13:34:53','2026-06-14 13:34:53'),(513,1,'withdrawal',200.00,5445.00,5245.00,NULL,'2026-06-14 20:40:36','2026-06-14 20:40:36'),(514,52,'deposit',40.00,50.00,90.00,'رقية','2026-06-15 15:33:18','2026-06-15 15:33:18'),(515,1,'withdrawal',600.00,5245.00,4645.00,NULL,'2026-06-16 11:47:24','2026-06-16 11:47:24'),(516,1,'withdrawal',100.00,4645.00,4545.00,NULL,'2026-06-16 11:47:35','2026-06-16 11:47:35'),(517,1,'deposit',300.00,4545.00,4845.00,NULL,'2026-06-16 17:31:11','2026-06-16 17:31:11'),(518,34,'withdrawal',300.00,395.00,95.00,NULL,'2026-06-17 16:50:49','2026-06-17 16:50:49'),(519,1,'deposit',300.00,4845.00,5145.00,NULL,'2026-06-18 19:25:24','2026-06-18 19:25:24'),(520,36,'withdrawal',200000.00,200000.00,0.00,NULL,'2026-06-18 19:25:55','2026-06-18 19:25:55'),(521,4,'deposit',100.00,-530.00,-430.00,'عيدية','2026-06-18 19:26:34','2026-06-18 19:26:34'),(522,4,'withdrawal',200.00,-430.00,-630.00,NULL,'2026-06-18 19:26:40','2026-06-18 19:26:40'),(523,44,'deposit',280000.00,-280000.00,0.00,NULL,'2026-06-26 14:16:33','2026-06-26 14:16:33'),(524,1,'withdrawal',200.00,5145.00,4945.00,NULL,'2026-06-26 14:16:59','2026-06-26 14:16:59'),(525,2,'deposit',100.00,-2255.00,-2155.00,'لابتسام','2026-06-26 14:17:17','2026-06-26 14:17:17'),(526,2,'deposit',100.00,-2155.00,-2055.00,'لابتسام','2026-06-26 15:22:14','2026-06-26 15:22:14'),(527,1,'deposit',300.00,4945.00,5245.00,NULL,'2026-07-06 13:14:23','2026-07-06 13:14:23'),(528,34,'withdrawal',300.00,95.00,-205.00,NULL,'2026-07-06 13:14:58','2026-07-06 13:14:58'),(529,44,'deposit',75000.00,0.00,75000.00,NULL,'2026-07-10 11:09:29','2026-07-10 11:09:29'),(530,44,'deposit',750000.00,75000.00,825000.00,NULL,'2026-07-10 11:09:36','2026-07-10 11:09:36'),(531,44,'deposit',93000.00,825000.00,918000.00,NULL,'2026-07-10 11:09:41','2026-07-10 11:09:41'),(532,44,'withdrawal',750000.00,918000.00,168000.00,NULL,'2026-07-10 11:09:57','2026-07-10 11:09:57'),(533,44,'deposit',75000.00,168000.00,243000.00,NULL,'2026-07-10 11:10:03','2026-07-10 11:10:03'),(534,15,'deposit',400.00,0.00,400.00,'تصليح سيارة','2026-07-14 19:22:55','2026-07-14 19:22:55'),(535,15,'deposit',150.00,400.00,550.00,'لرغد','2026-07-14 19:23:03','2026-07-14 19:23:03'),(536,15,'deposit',920.00,550.00,1470.00,'تصليح سيارة','2026-07-16 15:03:40','2026-07-16 15:03:40');
/*!40000 ALTER TABLE `transactions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `users_email_unique` (`email`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'Ahmad Ram','ahmadram','2025-06-16 19:49:54','$2y$12$mvuBL6v4UbPgW8gdUPzLOuUjo6OMv8El5Q43X6blZBC/2zq28G3Pi','89gmx2qn6LqsLBEr5nJ5EVS5EfgzVARA2Duy6PcOka0Gv25ijWXqktdP9MdH','2025-06-16 19:49:54','2025-06-16 19:49:54');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-07-17 11:50:50
